In [2]:
import pandas as pd

##### Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите, какому фильму было выставлено больше всего оценок 5.0.

In [2]:
movie_rate = pd.read_csv('movielens/ratings.csv')

In [3]:
# оставляем в списке только фильмы с рейтингом 5, считаем количество каждого movieId, выводим топ-1
ranked_first = movie_rate[ movie_rate.rating == 5.0 ].movieId.value_counts().index[0]

In [4]:
f'Больше всего оценок 5.0 выставлено фильму с id {ranked_first}'

'Больше всего оценок 5.0 выставлено фильму с id 318'

##### Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [3]:
power = pd.read_csv('power.csv')

In [4]:
baltic = ['Lithuania', 'Latvia', 'Estonia']

In [5]:
category = [4, 12, 21]

In [8]:
power_consumption = power.loc[ power['country'].isin(baltic) & power['category'].isin(category) & \
         (power['year'] >= 2005) & (power['year'] <= 2010) & (power['quantity'] > 0) ]

In [7]:
power.loc[ power['country'].isin(baltic) & power['category'].isin(category) & \
         power['year'].between(2005, 2010) & (power['quantity'] > 0) ]

          country  year  quantity  category
10617     Estonia  2008       1.0         4
10620     Estonia  2005       1.0         4
11156   Lithuania  2008       1.0         4
11158   Lithuania  2006       1.0         4
11159   Lithuania  2005       1.0         4
...           ...   ...       ...       ...
253982  Lithuania  2009      98.0        21
253983  Lithuania  2008      54.0        21
253984  Lithuania  2007      47.0        21
253985  Lithuania  2006      31.0        21
253986  Lithuania  2005       1.0        21

[347 rows x 4 columns]

In [9]:
consumption_sum = power_consumption['quantity'].sum()

In [10]:
f'Суммарное потребление стран Прибалтики — {consumption_sum}'

'Суммарное потребление стран Прибалтики — 240580.0'

##### Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):

https://fortrader.org/quotes

https://www.finanz.ru/valyuty/v-realnom-vremeni

In [11]:
pd.read_html('https://fortrader.org/quotes')[0]

                           Название   Цена  Изменение  Изменение(%)  Обновлено
0  EURRUB Курс евро к рублю сегодня  84.19      -7.06         -7.73        NaN
1       USDRUB Курс рубля к доллару  79.20      -6.35         -7.42        NaN

In [12]:
pd.read_html('https://fortrader.org/quotes')[1]

,Название,Цена,Изменение,Изменение(%),Обновлено
0,Нефть Brent Курс нефти сегодня,116.06,0.00,0.00,NaN
1,Нефть WTI Цены на нефть WTI,106.00,-4.24,-3.85,NaN
2,Природный газ Цена на природный газ,7.30,2.16,42.15,NaN
3,Кофе,225.05,0.00,0.00,NaN
4,Кукуруза,789.60,38.20,5.08,NaN
5,Соя,461.00,-18.80,-3.92,NaN
6,Хлопок,130.45,0.00,0.00,NaN

In [13]:
pd.read_html('https://fortrader.org/quotes')[2]

                           Название   Цена  Изменение  Изменение(%)  Обновлено
0       Золото Цена золота на бирже  1 969      19.00          1.00        NaN
1  Серебро Цена на серебро на бирже  25.64       0.81          3.28        NaN
2         Палладий Цена на Палладий  2 298    -255.00        -10.00        NaN
3           Платина Цены на платину    991     -29.00         -3.00        NaN
4           Медь Цена меди на бирже   4.72       0.02          0.38        NaN